In [1]:
import numpy as np
import pandas as pd
from numpy.random import randn

# 1. Series

## a. Create a serie

- ## data must be 1-dimensional

- ### data type needs an order: list, tuple, array...

In [7]:
labels=['a','b','c','d','e']
my_data=[1,2,3,4,5]
a=np.array(my_data)
d={'a':1,'b':2,'c':3,'d':4,'e':5}

In [8]:
# pass in a list
pd.Series(my_data)

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [9]:
# pass in a list together with a list of labels
pd.Series(my_data,labels)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [10]:
# pass in with 'data=' and 'index='
pd.Series(data=my_data,index=labels)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [12]:
# pass in an array
pd.Series(a,labels)

a    1
b    2
c    3
d    4
e    5
dtype: int32

In [35]:
# pass in a dict, auto define index and data
pd.Series(d)

a    1
b    2
c    3
d    4
e    5
dtype: int64

In [15]:
# tuple
pd.Series((1,2,3,4))

0    1
1    2
2    3
3    4
dtype: int64

## b. Select member as in a list or dict

In [42]:
s0=pd.Series(data=[1,2,3])
s0

0    1
1    2
2    3
dtype: int64

In [44]:
s0[1]

2

In [38]:
s1=pd.Series([1,2,3,4],['a','b','c','d'])
s1

a    1
b    2
c    3
d    4
dtype: int64

In [20]:
s1['c']

3

In [39]:
s2=pd.Series([1,2,6,4],['a','b','e','d'])
s2

a    1
b    2
e    6
d    4
dtype: int64

In [22]:
s2['e']

6

## c. Operations between Series

In [24]:
# addition ... only works under condition like same types
s1+s2

a    2.0
b    4.0
c    NaN
d    8.0
e    NaN
dtype: float64

# 2. Dataframes

- ## A dataframe is a collection of Series

## a. Create by `data` = matrix, `index`=list, `columns`=list

- ### `data` must be 2d
- ### notice a list is **not** 1d, its shape is (a, ) which is m x 1.
- ### selecttion: use [ ] for selecting columns. Each column is again a Serie, so we can use [ ] to select as in Serie

In [31]:
np.random.seed(101)

In [15]:
# a list is considered as an array, and then a serie in column form!!!
np.array([1,2,3]).shape

(3,)

In [45]:
# cast in a set
pd.DataFrame({1,5,1,2,5})

   0
0  1
1  2
2  5

In [8]:
# cast in a list
pd.DataFrame([1,2,3])

   0
0  1
1  2
2  3

In [32]:
# cast in a tuple
pd.DataFrame((1,2,3,4))

   0
0  1
1  2
2  3
3  4

In [34]:
# cast in an array with shape differs 0 always work, since array is always 2d: shape is (a, 1) or (c, b)
pd.DataFrame(np.array((1,2,3)))

   0
0  1
1  2
2  3

In [8]:
# cast in a dict, not work
d={'a':1,'b':2,'c':3}
pd.DataFrame(d)  # give error

ValueError: If using all scalar values, you must pass an index

In [2]:
d = {'a':[1],'b':[2],'c':[3]}
pd.DataFrame(d)

   a  b  c
0  1  2  3

In [23]:
# however, if a dic has at least one value of the type: list and set then it works and keys are the names of columns
d={'a':{1} ,'b':2,'c':3 }
pd.DataFrame(d)

     a  b  c
0  {1}  2  3

In [3]:
np.array([1,2,3]).reshape(1,3)

array([[1, 2, 3]])

In [6]:
pd.DataFrame(np.array([1,2,3]).reshape(1,3))

   0  1  2
0  1  2  3

**Achtung**

In [10]:
pd.DataFrame(data={'a':[1],'b':[2],'c':[3]},index=[1,3,6])

   a  b  c
1  1  2  3
3  1  2  3
6  1  2  3

In [12]:
pd.DataFrame(data={'a':[1,2,3],'b':[2,3,4],'c':[3,4,5]},index=[1,3,6])

   a  b  c
1  1  2  3
3  2  3  4
6  3  4  5

In [13]:
pd.DataFrame(data={'a':[1,2,3],'b':[2,3,4],'c':[3,4,5]},index=[1,3,6],columns=('A','M','N'))

     A    M    N
1  NaN  NaN  NaN
3  NaN  NaN  NaN
6  NaN  NaN  NaN

In [17]:
pd.DataFrame(data=np.arange(0,20).reshape(4,5), index=['a','b','c','d'], columns=('M','N','P','Q','R'))

    M   N   P   Q   R
a   0   1   2   3   4
b   5   6   7   8   9
c  10  11  12  13  14
d  15  16  17  18  19

### Before moving ahead, note that cast in a dict into array gives shape (   ) with no information. This means it is not a 2d data.

### To cast a dict into df, make it a Serie

In [54]:
np.array(d)

array({'a': 1, 'b': 2, 'c': 3}, dtype=object)

In [48]:
# a dict in an array is nothing!
np.array(d).shape #

()

In [51]:
pd.Series(np.array(d)).shape

(1,)

In [52]:
# make a serie first
pd.DataFrame(pd.Series(d))

   0
a  1
b  2
c  3

In [53]:
# make a serie, but result is strange. This is because np.array(d) gives an object of no dimension.
pd.DataFrame(pd.Series(np.array(d)))

                          0
0  {'a': 1, 'b': 2, 'c': 3}

In [55]:
df=pd.DataFrame(data=randn(3,4), index=['a','b','c'],columns=['x','y','z','t'])
df

          x         y         z         t
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001

In [3]:
df=pd.DataFrame(data=randn(3,4),columns=['x','y','z','t'])
df

          x         y         z         t
0 -0.975850 -1.424263  1.969346  0.766044
1 -0.348410 -2.490945 -0.133304 -0.001007
2 -1.248737  0.382402 -1.520178  0.030411

In [4]:
df=pd.DataFrame(data=randn(3,4))
df

          0         1         2         3
0 -1.182389  1.723522 -1.085715 -0.909926
1  1.350879  0.758867  0.268976 -1.463855
2  0.564810 -1.728718 -0.302354  1.874664

## b. Selection

In [57]:
df

          x         y         z         t
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001

In [58]:
# select a column, which is a Serie
df['x']

a    2.706850
b    0.651118
c   -2.018168
Name: x, dtype: float64

In [59]:
# select 2 columns, put in a list
df[['x','y']]

          x         y
a  2.706850  0.628133
b  0.651118 -0.319318
c -2.018168  0.740122

In [60]:
# select a row
df.loc['b']

x    0.651118
y   -0.319318
z   -0.848077
t    0.605965
Name: b, dtype: float64

In [81]:
df.loc['b']['z']

-0.8480769834036315

In [63]:
# select rows, put in a list
df.loc[['b','c']]

          x         y         z         t
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001

In [64]:
# similar to selection in arrays, use a comma and more, two sets of indices in two lists
#df.loc[[],[]]

df.loc[['a','c'],['x','t']]

          x         t
a  2.706850  0.503826
c -2.018168 -0.589001

### Boolean df

In [66]:
df

          x         y         z         t
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001

In [69]:
# quite similar to array
df>0

       x      y      z      t
a   True   True   True   True
b   True  False  False   True
c  False   True   True  False

In [70]:
df[df>0]

          x         y         z         t
a  2.706850  0.628133  0.907969  0.503826
b  0.651118       NaN       NaN  0.605965
c       NaN  0.740122  0.528813       NaN

In [71]:
df['x']>0 # get a boolean serie

a     True
b     True
c    False
Name: x, dtype: bool

### select row satisfying a condition

In [76]:
# select row satisfying a condition
df[df['x']>0]

          x         y         z         t
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965

### select rows with many conditions: using and: &,  or: |

In [74]:
df[(df['x']>0) | (df['y']<1)]

          x         y         z         t
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001

### select columns with conditions

In [ ]:
df.loc[:,df.loc[2]==2] # for example

## c. Index

In [77]:
df

          x         y         z         t
a  2.706850  0.628133  0.907969  0.503826
b  0.651118 -0.319318 -0.848077  0.605965
c -2.018168  0.740122  0.528813 -0.589001

In [78]:
# reset index
df.reset_index() # keep old index

  index         x         y         z         t
0     a  2.706850  0.628133  0.907969  0.503826
1     b  0.651118 -0.319318 -0.848077  0.605965
2     c -2.018168  0.740122  0.528813 -0.589001

In [79]:
# set index
df.set_index('t') # write upon old index

                  x         y         z
t
 0.503826  2.706850  0.628133  0.907969
 0.605965  0.651118 -0.319318 -0.848077
-0.589001 -2.018168  0.740122  0.528813

In [80]:
# do both :)
df.reset_index().set_index('t')

          index         x         y         z
t
 0.503826     a  2.706850  0.628133  0.907969
 0.605965     b  0.651118 -0.319318 -0.848077
-0.589001     c -2.018168  0.740122  0.528813

## d. Multi index. I like that :)

In [82]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index)

In [83]:
zip(outside,inside)

In [85]:
list(zip(outside,inside)) # a list of tuples

[('G1', 1), ('G1', 2), ('G1', 3), ('G2', 1), ('G2', 2), ('G2', 3)]

In [86]:
hier_index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [89]:
df=pd.DataFrame(randn(6,2),index=hier_index, columns=['a','b'])
df

             a         b
G1 1 -0.116773  1.901755
   2  0.238127  1.996652
   3 -0.993263  0.196800
G2 1 -1.136645  0.000366
   2  1.025984 -0.156598
   3 -0.031579  0.649826

In [90]:
df['a'] # gives a df with only one col

G1  1   -0.116773
    2    0.238127
    3   -0.993263
G2  1   -1.136645
    2    1.025984
    3   -0.031579
Name: a, dtype: float64

In [91]:
df.loc['G1'] # gives a df, not a row

          a         b
1 -0.116773  1.901755
2  0.238127  1.996652
3 -0.993263  0.196800

### Name index

In [92]:
df.index

MultiIndex([('G1', 1),
            ('G1', 2),
            ('G1', 3),
            ('G2', 1),
            ('G2', 2),
            ('G2', 3)],
           )

In [93]:
df.index.names

FrozenList([None, None])

In [94]:
# set a name
df.index.names=['Con chim','Con ku']

In [95]:
df

                        a         b
Con chim Con ku
G1       1      -0.116773  1.901755
         2       0.238127  1.996652
         3      -0.993263  0.196800
G2       1      -1.136645  0.000366
         2       1.025984 -0.156598
         3      -0.031579  0.649826

In [96]:
df.reset_index()

  Con chim  Con ku         a         b
0       G1       1 -0.116773  1.901755
1       G1       2  0.238127  1.996652
2       G1       3 -0.993263  0.196800
3       G2       1 -1.136645  0.000366
4       G2       2  1.025984 -0.156598
5       G2       3 -0.031579  0.649826

## Cross section

In [98]:
df

                        a         b
Con chim Con ku
G1       1      -0.116773  1.901755
         2       0.238127  1.996652
         3      -0.993263  0.196800
G2       1      -1.136645  0.000366
         2       1.025984 -0.156598
         3      -0.031579  0.649826

In [102]:
df.xs('G1',level='Con chim')

               a         b
Con ku
1      -0.116773  1.901755
2       0.238127  1.996652
3      -0.993263  0.196800

In [103]:
df.xs(1,level='Con ku')

                 a         b
Con chim
G1       -0.116773  1.901755
G2       -1.136645  0.000366

## e. Missing values

In [24]:
d={'A':[1,2,np.nan],'B':[5,np.nan,np.nan],'C':[1,2,3]}

In [25]:
df=pd.DataFrame(d)

In [26]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [27]:
# drop rows
df.dropna()

     A    B  C
0  1.0  5.0  1

In [28]:
# drop cols
df.dropna(axis=1)

   C
0  1
1  2
2  3

In [34]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [39]:
# drops only on subset, labeled along other axis
df.dropna(axis=1,how='any',subset=[2,1])

   C
0  1
1  2
2  3

In [40]:
# fill na for whole df
df.fillna(1) # or df.fillna(value=1)

     A    B  C
0  1.0  5.0  1
1  2.0  1.0  2
2  1.0  1.0  3

In [41]:
# fill na for a col by mean
df['A'].fillna(value=df['A'].mean())

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

In [42]:
df

     A    B  C
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

## f. Groupby

In [44]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}
df=pd.DataFrame(data)
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

## g. Operations

In [3]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [6]:
# unique values
df['col2'].nunique()

3

In [7]:
# unique values with count
df['col2'].value_counts()

444    2
555    1
666    1
Name: col2, dtype: int64

In [8]:
df[df['col1']<3]

   col1  col2 col3
0     1   444  abc
1     2   555  def

In [36]:
def f(x=100):
    return x%5

In [37]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

### Apply functions

In [20]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':[4,9,16,25]})
df

   col1  col2  col3
0     1   444     4
1     2   555     9
2     3   666    16
3     4   444    25

In [21]:
def f(cols): # it is really a row, not a col
    a = cols[0]
    b = cols[1]
    c = cols[2]
    return a + c

In [30]:
def g(row): # it is really a row, not a col
    a = row[0]
    b = row[1]
    c = row[2]
    if row[1] >400:
        return row[0] + row[2]
    else:
        return row[1]

In [31]:
# warum hier???
df.apply(g,axis=1)

0     5
1    11
2    19
3    29
dtype: int64

In [23]:
df.apply(f,axis=1)

0     5
1    11
2    19
3    29
dtype: int64

In [16]:
df[['col2', 'col1']].apply(f)

   col2  col1
0     4     1
1     0     2
2     1     3
3     4     4

In [18]:
df[['col2', 'col1']].apply(f,axis=1)

   col2  col1
0     4     1
1     0     2
2     1     3
3     4     4

In [38]:
df['col2'].apply(f)

0    4
1    0
2    1
3    4
Name: col2, dtype: int64

In [41]:
df['col2'].apply(lambda x: #number
                 x%5)

0    4
1    0
2    1
3    4
Name: col2, dtype: int64

In [39]:
df['col3'].apply(len)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [43]:
df['col3'].apply(lambda st: st+'ku')

0    abcku
1    defku
2    ghiku
3    xyzku
Name: col3, dtype: object

In [46]:
df[['col1','col2']].apply(lambda x:#number
                         x*2%5)

   col1  col2
0     2     3
1     4     0
2     1     2
3     3     3

### sort

In [48]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [49]:
df.sort_values('col2',ascending=False)

   col1  col2 col3
2     3   666  ghi
1     2   555  def
0     1   444  abc
3     4   444  xyz

In [50]:
df.sort_values('col2',ascending=False,ignore_index=True)

   col1  col2 col3
0     3   666  ghi
1     2   555  def
2     1   444  abc
3     4   444  xyz

### pivot table

In [52]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

### values of C become names of new columns, values in D become values in new df, new index is multi index

In [70]:
a=df.pivot_table(index=['A','B'],columns='C',values='D')
a

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

In [71]:
b=df.pivot_table(index=['B', 'A'],columns='C',values='D')
b

C          x    y
B   A
one bar  4.0  1.0
    foo  1.0  3.0
two bar  NaN  5.0
    foo  2.0  NaN

In [72]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

## h. Input and output

In [78]:
pwd

'C:\\Users\\BVMT\\Desktop\\My Prog Knowl'

## i. Null values

In [6]:
df = pd.DataFrame({'col1':[1,2,3,np.nan],'col2':[444,555,666,444],'col3':['abc',np.nan,'ghi','xyz']})

In [7]:
df

   col1  col2 col3
0   1.0   444  abc
1   2.0   555  NaN
2   3.0   666  ghi
3   NaN   444  xyz

In [10]:
pd.isnull(df['col3'])

0    False
1     True
2    False
3    False
Name: col3, dtype: bool

In [13]:
pd.isnull(df['col1'])

0    False
1    False
2    False
3     True
Name: col1, dtype: bool

In [14]:
df

   col1  col2 col3
0   1.0   444  abc
1   2.0   555  NaN
2   3.0   666  ghi
3   NaN   444  xyz

In [17]:
df[1:3]

   col1  col2 col3
1   2.0   555  NaN
2   3.0   666  ghi